quest_system_950842508_name=^?^The Portrait of the Griffins' King
quest_system_950842508_stage_0=^?^Find the artist Alex.
quest_system_950842508_stage_1=^?^Find the Dwarf Decar and ask him for some gold gilt.
quest_system_950842508_stage_2=^?^Collect ore for making the gilt.<br>Collected: [count]/7.
quest_system_950842508_stage_3=^?^Bring the collected ore to Decar.
quest_system_950842508_stage_4=^?^Bring the gilt to the artist Alex, and receive the portrait.
quest_system_950842508_stage_5=^?^Go to Harl and ask him for an additional ten thousand gold.
quest_system_950842508_stage_6=^?^Present the portrait to the King Harl.
quest_system_950842508_task=^?^The Griffin King Harl has asked you to go to the artist Alex, who lives on the eastern coast of the island, and request that he make a portrait of the king.<br>[reward]
